In [1]:
import pandas as pd
import numpy as np
# Create data
stuff = {
    'Corporation' : ['Apple','Google','Meta','Apple','Google','Meta'],
    'Employees' : ['John','April','Wes','Beth','Justin','Steph'],
    'Salary' : [200,220,190,130,120,150]
}
# Create dataframe
my_df = pd.DataFrame(stuff)
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [2]:
# Create function
def times1000(x):
    return x*1000
    # For adding commas
    # return format(x*1000,",d")

In [4]:
# Apply function
my_df['Salary']=my_df["Salary"].apply(times1000)

In [ ]:
my_df

In [6]:
# Make it into a dataframe
pd.DataFrame(my_df["Salary"].apply(times1000))

      Salary
0  200000000
1  220000000
2  190000000
3  130000000
4  120000000
5  150000000

In [7]:
# Add elder last name
def namer(x):
    if(x=='John'):
        return "John Elder"
    else:
        return x

In [8]:
# Show Elder last name
my_df["Employees"].apply(namer)

0    John Elder
1         April
2           Wes
3          Beth
4        Justin
5         Steph
Name: Employees, dtype: object

In [10]:
# Use Lambda
my_df["Salary"].apply(lambda x: format(x*1000,",d"))

0    200,000,000
1    220,000,000
2    190,000,000
3    130,000,000
4    120,000,000
5    150,000,000
Name: Salary, dtype: object